app/controllers/api/stocks_controller.rb

SELECT "stocks".* FROM "stocks"
---
    def index
        @stocks = Stock.all

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @stock = Stock.find_by_id(params[:id])