app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "WTq4V49axRvgcDQSqLCwCQ"], ["updated_at", "2020-11-17 01:48:59.432477"], ["id", 1]]